Autodesk.Revit.DB.NumberedReferenceInfo.GetReference
The target reference for this object.

Autodesk.Revit.DB.NumberedReferenceInfo.Value
The integer representation of number associated with this reference.

Autodesk.Revit.DB.NumberedReferenceInfo.FormattedNumber
The formated number associated with this reference.

Autodesk.Revit.DB.NumberedReferenceInfo.NumberingParameterId
The parameter id associated with this reference that is used for numbering.

Autodesk.Revit.DB.NumberedReferenceInfo.PartitionName
The partition associated with this reference.

Autodesk.Revit.DB.NumberedReferenceInfo.NumberingSchemaId
The numbering schema associated with this reference.

Autodesk.Revit.DB.NumberedReferenceInfo.NumberingSchemaName
The name of the numbering schema associated with this reference.

Autodesk.Revit.DB.NumberedReferenceInfo
Numbering info for a reference.